```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.github-repository.github_issue_label.main["Enhancement"] will be created
  + resource "github_issue_label" "main" {
      + color       = "c5def5"
      + description = "Indicates new feature requests"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Enhancement"
      + repository  = "playground.ashdavies.dev"
      + url         = (known after apply)
    }

  # module.github-repository.github_issue_label.main["enhancement"] will be destroyed
  # (because key ["enhancement"] is not in for_each map)
  - resource "github_issue_label" "main" {
      - color       = "c5def5" -> null
      - description = "Indicates new feature requests" -> null
      - etag        = "W/"cd3b5030f223cef416bb8b3f5bf56cc41429d1ad8fdd6944eae3048713180e57"" -> null
      - id          = "playground.ashdavies.dev:enhancement" -> null
      - name        = "enhancement" -> null
      - repository  = "playground.ashdavies.dev" -> null
      - url         = "https://api.github.com/repos/ashdavies/playground.ashdavies.dev/labels/enhancement" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```